title: SharePoint/OneDrive Mass Download
id: cloud-01
status: experimental
description: Portfolio detection example for cloud.
author: Riya Patel
date: 2026/02/02
logsource:
  category: cloud
  product: generic
detection:
  selection:
    detection_id: "CLOUD-01"
  condition: selection
level: medium
tags:
  - attack.cloud-01
