title: Mailbox Forwarding Rule Created
id: email-03
status: experimental
description: Portfolio detection example for email.
author: Riya Patel
date: 2026/02/02
logsource:
  category: email
  product: generic
detection:
  selection:
    detection_id: "EMAIL-03"
  condition: selection
level: medium
tags:
  - attack.email-03
